export const DATA = {
    1: {
        name: "Координатное пространство",
        1: {
            name: "Точка",
            1: {
                name: "Координаты точки",
            },
            2: {
                name: "Точка на отрезке",
            }
        },
        2: {
            name: "Вектор",
            
            1: {
                name: "Координаты вектора",
                
            },
            2: {
                name: "Действия с векторами",
                
            },
            3: {
                name: "Параллельность векторов",
                
            },
            4: {
                name: "Скалярное произведение",
                
            },
            5: {
                name: "Длина вектора",
                
            },
            6: {
                name: "Угол между векторами",
                
            },
        },
        3: {
            name: "Прямая",
            
            1: {
                name: "Направляющий вектор",
                
            },
            2: {
                name: "Уравнения прямой",
                
            },
        },
        4: {
            name: "Плоскость",
            
            1: {
                name: "Нормальный вектор",
                
            },
            2: {
                name: "Уравнение плоскости",
                
            }
        }
    },
    2: {
        name: "Задачи в координатах",
        
        1: {
            name: "Угол между прямыми",
            
        },
        2: {
            name: "Угол между прямой и плоскостью",
            
        },
        3: {
            name: "Угол между плоскостями",
            
        },
        4: {
            name: "Расстояние между точками",
            
        },
        5: {
            name: "Расстояние от точки до прямой",
            
        },
        6: {
            name: "Расстояние от точки до плоскости",
            
        },
        7: {
            name: "Расстояние от прямой до плоскости",
            
        },
        8: {
            name: "Расстояние между плоскостями",
            
        },
        9: {
            name: "Расстояние между прямыми",
            
        },
    },
    3: {
        name: "Система координат для тел",
        
        1: {
            name: "Прямоугольный параллелепипед",
            
        },
        2: {
            name: "Правильная четырёхугольная пирамида",
            
        },
        3: {
            name: "Правильная треугольная призма",
            
        },
        4: {
            name: "Правильная треугольная пирамида",
            
        },
        5: {
            name: "Правильная шестиугольная призма",
            
        },
        6: {
            name: "Правильная шестиугольная пирамида",
            
        },
        7: {
            name: "Конус",
            
        },
        8: {
            name: "Цилиндр",
            
        },
        9: {
            name: "Шар",
            
        },
    },
    4: {
        name: "Задачи стереометрии"
    },
}