import { Tex } from "./Tex";

export const DATA = {
    ids: [
        "1.1.1.1",
        "1.1.2.1",
        "1.1.2.2",
        "1.1.2.3",
        "1.1.2.4",
        "1.2.1.1",
        "1.2.2.1",
        "1.2.3.1",
        "1.2.4.1",
        "1.2.5.1",
        "1.2.6.1",
    ],
    1: {
        name: "Координатное пространство",
        1: {
            name: "Точка",
            1: {
                name: "Координаты точки",
                tasks: [
                    <div answer="15">
                        <div>Даны точки:  <Tex>{"A(1;~2;~3),~B(4;~5;~6),~C(7;~8;~9)"}</Tex>.</div>
                        <div>Найдите <Tex>{"A_x + B_y + C_z"}</Tex>.</div>
                    </div>
                ]
            },
            2: {
                name: "Точка на отрезке",
                tasks: [
                    <div answer="-2-2-5">
                        <div>Найдите координаты середины отрезка <Tex>{"AB"}</Tex>,</div>
                        <div>если <Tex>{"A(3;-10;-3),~B(-7;6;-7)"}</Tex>.</div>
                    </div>,
                    <div answer="-3-2-1">
                        <div>
                            Дана точка <Tex>{"A(1;2;3)"}</Tex>. Точка <Tex>{"B(-1;0;1)~"}</Tex> 
                            является серединой отрезка <Tex>{"AC"}</Tex>.
                        </div>
                        <div>
                            Найдите координаты точки <Tex>{"C"}</Tex>.
                        </div>
                    </div>,
                    <div answer="4-31">
                        <div>Дан отрезок <Tex>{"AB"}</Tex> с концами <Tex>{"A(4;0;4),~B(4;-5;-1)"}</Tex>.</div>
                        <div>На отрезке выбрана точка <Tex>{"C"}</Tex> так, что <Tex>{"AC:CB=3:2"}</Tex>.</div>
                        <div>Найдите координаты точки <Tex>{"C"}</Tex>.</div>
                    </div>,
                    <div answer="-132">
                        <div>Даны точки <Tex>{"A(5;0;-4),~B(1;2;0)"}</Tex>. <Tex>{"AB = 10"}</Tex> .</div>
                        <div>Отрезок <Tex>{"AB"}</Tex> продлили за точку <Tex>{"B"}</Tex> на <Tex>{"BC=5"}</Tex>. </div>
                        <div>Найдите координаты точки <Tex>{"C"}</Tex>.</div>
                    </div>
                ]
            }
        },
        2: {
            name: "Вектор",
            
            1: {
                name: "Координаты вектора",
                
            },
            2: {
                name: "Действия с векторами",
                
            },
            3: {
                name: "Параллельность векторов",
                
            },
            4: {
                name: "Скалярное произведение",
                
            },
            5: {
                name: "Длина вектора",
                
            },
            6: {
                name: "Угол между векторами",
                
            },
        },
        3: {
            name: "Прямая",
            
            1: {
                name: "Направляющий вектор",
                
            },
            2: {
                name: "Уравнения прямой",
                
            },
        },
        4: {
            name: "Плоскость",
            
            1: {
                name: "Нормальный вектор",
                
            },
            2: {
                name: "Уравнение плоскости",
                
            }
        }
    },
    2: {
        name: "Задачи в координатах",
        
        1: {
            name: "Угол между прямыми",
            
        },
        2: {
            name: "Угол между прямой и плоскостью",
            
        },
        3: {
            name: "Угол между плоскостями",
            
        },
        4: {
            name: "Расстояние между точками",
            
        },
        5: {
            name: "Расстояние от точки до прямой",
            
        },
        6: {
            name: "Расстояние от точки до плоскости",
            
        },
        7: {
            name: "Расстояние от прямой до плоскости",
            
        },
        8: {
            name: "Расстояние между плоскостями",
            
        },
        9: {
            name: "Расстояние между прямыми",
            
        },
    },
    3: {
        name: "Система координат для тел",
        
        1: {
            name: "Прямоугольный параллелепипед",
            
        },
        2: {
            name: "Правильная четырёхугольная пирамида",
            
        },
        3: {
            name: "Правильная треугольная призма",
            
        },
        4: {
            name: "Правильная треугольная пирамида",
            
        },
        5: {
            name: "Правильная шестиугольная призма",
            
        },
        6: {
            name: "Правильная шестиугольная пирамида",
            
        },
        7: {
            name: "Конус",
            
        },
        8: {
            name: "Цилиндр",
            
        },
        9: {
            name: "Шар",
            
        },
    },
    4: {
        name: "Задачи стереометрии"
    }
}